resource/request_file/TataAIG_Car_Verification.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns6:PaymentEntryCumPolicyGen xmlns:ns2="http://schemas.datacontract.org/2004/07/AccountsBL" xmlns:ns3="http://schemas.datacontract.org/2004/07/WcfAccConfService" xmlns:ns4="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:ns5="http://schemas.datacontract.org/2004/07/GeneralServiceBL" xmlns:ns6="http://stub.unotechsoft.com/wsdl/AccountService/" xmlns:ns7="http://tempuri.org/" xmlns:ns8="http://schemas.datacontract.org/2004/07/GenericMasterBL" xmlns:ns9="http://schemas.microsoft.com/2003/10/Serialization/">
            <ns6:source>TATA-AIG</ns6:source><!--0-->
            <ns6:medium>POLICYBOSS</ns6:medium><!--0-->
            <ns6:campaign>POLICYBOSS</ns6:campaign><!--0-->
            <ns6:strLVTokenID></ns6:strLVTokenID>
            <ns6:objLVUserDataPEntryLst>
                <ns3:UserDataPaymentEntry>
                    <ns3:AcceptanceDate></ns3:AcceptanceDate>
                    <ns3:AcceptanceVoucherNumber>0</ns3:AcceptanceVoucherNumber>
                    <ns3:AllocationReqd>Y</ns3:AllocationReqd>
                    <ns3:AuthorizationCode></ns3:AuthorizationCode>
                    <ns3:BGId>0</ns3:BGId>
                    <ns3:BGTag>5</ns3:BGTag>
                    <ns3:BackDateAcc>0</ns3:BackDateAcc>
                    <ns3:BalanceAmount>0</ns3:BalanceAmount>
                    <ns3:BankAccountNo>002176410002</ns3:BankAccountNo><!--912020044796381-->
                    <ns3:BankCode>1907</ns3:BankCode><!--1001-->
                    <ns3:BankName>HSBC Bank</ns3:BankName><!--0-->
                    <ns3:BatchDate></ns3:BatchDate><!--HSBC Bank-->
                    <ns3:BatchNumber>0</ns3:BatchNumber>
                    <ns3:BckDtVal>|</ns3:BckDtVal>
                    <ns3:BounceReason></ns3:BounceReason>
                    <ns3:BranchCode></ns3:BranchCode>
                    <ns3:BranchName></ns3:BranchName>
                    <ns3:BusinessLocation>90200</ns3:BusinessLocation>
                    <ns3:BusinessLocationName>MUMBAI</ns3:BusinessLocationName>
                    <ns3:BusinessType>DIRECT</ns3:BusinessType>
                    <ns3:BusinessTypeCd>1</ns3:BusinessTypeCd>
                    <ns3:CMSSlipNumber></ns3:CMSSlipNumber>
                    <ns3:CallEnv>AP</ns3:CallEnv>
                    <ns3:CardHolderName></ns3:CardHolderName>
                    <ns3:ConversionAmount>0</ns3:ConversionAmount>
                    <ns3:CounterNo>0</ns3:CounterNo>
                    <ns3:CurrencyAmount>0</ns3:CurrencyAmount>
                    <ns3:CurrencyConcateString></ns3:CurrencyConcateString>
                    <ns3:CurrencyConvertRate>0</ns3:CurrencyConvertRate>
                    <ns3:DealerCode></ns3:DealerCode>
                    <ns3:DealerName></ns3:DealerName>
                    <ns3:DecimalPaymentAmount>___final_premium___</ns3:DecimalPaymentAmount>
                    <ns3:DepositAdviceDate>___current_date___</ns3:DepositAdviceDate>
                    <ns3:DepositOfficeCode>90200</ns3:DepositOfficeCode>
                    <ns3:DeptCode>0</ns3:DeptCode>
                    <ns3:DraweeBankLoc></ns3:DraweeBankLoc>
                    <ns3:Enable_Pol_Issue_Role_Wise>false</ns3:Enable_Pol_Issue_Role_Wise>
                    <ns3:EncodedCardNumber></ns3:EncodedCardNumber>
                    <ns3:EntryDate></ns3:EntryDate>
                    <ns3:ExpiryDate>01/01/2200</ns3:ExpiryDate>
                    <ns3:ForeignCurrencyAmount>0</ns3:ForeignCurrencyAmount>
                    <ns3:GenPolicyNo>1</ns3:GenPolicyNo>
                    <ns3:HoRefDate></ns3:HoRefDate>
                    <ns3:HoRefNo></ns3:HoRefNo>
                    <ns3:HouseBankBranchCode>19071037</ns3:HouseBankBranchCode>
                    <ns3:IFSCCode></ns3:IFSCCode>
                    <ns3:ILPosPaymentId></ns3:ILPosPaymentId>
                    <ns3:ITSPaymentId>0</ns3:ITSPaymentId>
                    <ns3:InsertedTransID>0</ns3:InsertedTransID>
                    <ns3:InsertedTransIDDate></ns3:InsertedTransIDDate>
                    <ns3:InstrumentTypeCd>0</ns3:InstrumentTypeCd>
                    <ns3:IntermediaryCode>___insurer_integration_location_code___</ns3:IntermediaryCode>
                    <ns3:IntermediaryName>LANDMARK INSURANCE BROKERS PVT LTD</ns3:IntermediaryName>
                    <ns3:InvoiceId></ns3:InvoiceId>
                    <ns3:InwardNumber>0</ns3:InwardNumber>
                    <ns3:IsAcceptanceApplicable>false</ns3:IsAcceptanceApplicable>
                    <ns3:IsDepositSlipNoGenerate>false</ns3:IsDepositSlipNoGenerate>
                    <ns3:IsPortalReceipt>false</ns3:IsPortalReceipt>
                    <ns3:MICRNumber>0</ns3:MICRNumber>
                    <ns3:MICRTag>0</ns3:MICRTag>
                    <ns3:MerchantId>___pg_reference_number_2___</ns3:MerchantId>
                    <ns3:ModifiedTransID>0</ns3:ModifiedTransID>
                    <ns3:ModifiedTransIDDate></ns3:ModifiedTransIDDate>
                    <ns3:MonthEndExtension></ns3:MonthEndExtension>
                    <ns3:MultiCustomerApplicability>true</ns3:MultiCustomerApplicability>
                    <ns3:MultiCustomerConcat></ns3:MultiCustomerConcat>
                    <ns3:MultiCustomerFlag>N</ns3:MultiCustomerFlag>
                    <ns3:NoteNumber>
                        <ns4:KeyValueOfstringint>
                            <ns4:Key>TotalAmount</ns4:Key>
                            <ns4:Value>0</ns4:Value>
                        </ns4:KeyValueOfstringint>
                        <ns4:KeyValueOfstringint>
                            <ns4:Key>Thousand</ns4:Key>
                            <ns4:Value>0</ns4:Value>
                        </ns4:KeyValueOfstringint>
                        <ns4:KeyValueOfstringint>
                            <ns4:Key>Fivehundred</ns4:Key>
                            <ns4:Value>0</ns4:Value>
                        </ns4:KeyValueOfstringint>
                        <ns4:KeyValueOfstringint>
                            <ns4:Key>Hundred</ns4:Key>
                            <ns4:Value>0</ns4:Value>
                        </ns4:KeyValueOfstringint>
                        <ns4:KeyValueOfstringint>
                            <ns4:Key>Fifty</ns4:Key>
                            <ns4:Value>0</ns4:Value>
                        </ns4:KeyValueOfstringint>
                        <ns4:KeyValueOfstringint>
                            <ns4:Key>Twenty</ns4:Key>
                            <ns4:Value>0</ns4:Value>
                        </ns4:KeyValueOfstringint>
                        <ns4:KeyValueOfstringint>
                            <ns4:Key>Ten</ns4:Key>
                            <ns4:Value>0</ns4:Value>
                        </ns4:KeyValueOfstringint>
                        <ns4:KeyValueOfstringint>
                            <ns4:Key>Five</ns4:Key>
                            <ns4:Value>0</ns4:Value>
                        </ns4:KeyValueOfstringint>
                        <ns4:KeyValueOfstringint>
                            <ns4:Key>Two</ns4:Key>
                            <ns4:Value>0</ns4:Value>
                        </ns4:KeyValueOfstringint>
                        <ns4:KeyValueOfstringint>
                            <ns4:Key>One</ns4:Key>
                            <ns4:Value>0</ns4:Value>
                        </ns4:KeyValueOfstringint>
                    </ns3:NoteNumber>
                    <ns3:NsurPlusPaymentID></ns3:NsurPlusPaymentID>
                    <ns3:PayerCustomerId>___customer_id___</ns3:PayerCustomerId>
                    <ns3:PayerName>___first_name___</ns3:PayerName>
                    <ns3:PayerType>Direct</ns3:PayerType>
                    <ns3:PayerTypeCd>1</ns3:PayerTypeCd>
                    <ns3:PayinSlipDate></ns3:PayinSlipDate>
                    <ns3:PayinSlipNumber>0</ns3:PayinSlipNumber>
                    <ns3:PaymentAmount>___transaction_amount___</ns3:PaymentAmount>
                    <ns3:PaymentDate>___current_date___</ns3:PaymentDate>
                    <ns3:PaymentId></ns3:PaymentId>
                    <ns3:PaymentMode>DA</ns3:PaymentMode>
                    <ns3:PaymentNumber>9999999999999999</ns3:PaymentNumber>
                    <ns3:PaymentType>-1</ns3:PaymentType>
                    <ns3:PolicyNumber></ns3:PolicyNumber>
                    <ns3:PostAuthCode>___pg_reference_number_3___</ns3:PostAuthCode>
                    <ns3:ProducerCode>___insurer_integration_location_code___</ns3:ProducerCode>
                    <ns3:PropCount>0</ns3:PropCount>
                    <ns3:ReceiptDate>___current_date___</ns3:ReceiptDate>
                    <ns3:ReconcileDate></ns3:ReconcileDate>
                    <ns3:RelationShip></ns3:RelationShip>
                    <ns3:Remarks>OK</ns3:Remarks>
                    <ns3:Status></ns3:Status>
                    <ns3:TAGICAccNo></ns3:TAGICAccNo>
                    <ns3:TransactionId>___pg_reference_number_1___</ns3:TransactionId>
                    <ns3:TransactionTime>___timestamp___</ns3:TransactionTime>
                    <ns3:TransactionType>2</ns3:TransactionType>
                    <ns3:UserId>___insurer_integration_location_code___</ns3:UserId>
                    <ns3:UserRole>BROKER CORPORATE</ns3:UserRole>
                    <ns3:VoucherNoMiscTransfer>0</ns3:VoucherNoMiscTransfer>
                    <ns3:YNOthersType></ns3:YNOthersType>
                </ns3:UserDataPaymentEntry>
            </ns6:objLVUserDataPEntryLst>
            <ns6:objUserDataSubReceipt>
                <ns3:CallSLEnv>AP</ns3:CallSLEnv>
                <ns3:TransactionID>___pg_reference_number_1___</ns3:TransactionID>
                <ns3:UserID>___insurer_integration_location_code___</ns3:UserID>
            </ns6:objUserDataSubReceipt>
            <ns6:objUserDataPaymentTaging>
                <ns3:AutoAcceptanceApplicable>0</ns3:AutoAcceptanceApplicable>
                <ns3:BankChargeAmt>0</ns3:BankChargeAmt>
                <ns3:BusinessType>1</ns3:BusinessType>
                <ns3:CallSLEnv>AP</ns3:CallSLEnv>
                <ns3:CheckAutoProposal>1</ns3:CheckAutoProposal>
                <ns3:CheckAutopayment>1</ns3:CheckAutopayment>
                <ns3:ClsProposalDetailsGrd>
                    <ns3:ClsPolicyIdGrid>
                        <ns3:BankCharge>0</ns3:BankCharge>
                        <ns3:IsChecked>true</ns3:IsChecked>
                        <ns3:ProposalDate>___current_date___</ns3:ProposalDate>
                        <ns3:ProposalNo>___proposal_no___</ns3:ProposalNo>
                    </ns3:ClsPolicyIdGrid>
                </ns3:ClsProposalDetailsGrd>
                <ns3:DealerId></ns3:DealerId>
                <ns3:FinancierID>0</ns3:FinancierID>
                <ns3:GenPolicy>0</ns3:GenPolicy>
                <ns3:InstrumentAmount>0</ns3:InstrumentAmount>
                <ns3:IntermediaryId>0</ns3:IntermediaryId>
                <ns3:Is64vbAllowed>false</ns3:Is64vbAllowed>
                <ns3:IsAutoPaymentChecked>false</ns3:IsAutoPaymentChecked>
                <ns3:IsAutoPropChecked>false</ns3:IsAutoPropChecked>
                <ns3:IsCreditPolicy>false</ns3:IsCreditPolicy>
                <ns3:IsShortFallNonAllowedFlg>false</ns3:IsShortFallNonAllowedFlg>
                <ns3:IsShortPremAllowedFlg>false</ns3:IsShortPremAllowedFlg>
                <ns3:MaxPremium>0</ns3:MaxPremium>
                <ns3:ModeOfEntry>5</ns3:ModeOfEntry>
                <ns3:MonthlyExtension>0</ns3:MonthlyExtension>
                <ns3:OfficeCode>90200</ns3:OfficeCode>
                <ns3:OtherBankApplicability>0</ns3:OtherBankApplicability>
                <ns3:PayerId>___customer_id___</ns3:PayerId><!--customer id from proposal-->
                <ns3:PayerType></ns3:PayerType>
                <ns3:ProposalAmount>___final_premium___</ns3:ProposalAmount>
                <ns3:ProposalId>___proposal_no___</ns3:ProposalId>
                <ns3:ProposalUnPaidAmount>0</ns3:ProposalUnPaidAmount>
                <ns3:ShortPremium>0</ns3:ShortPremium>
                <ns3:TagSequence>0</ns3:TagSequence>
                <ns3:TotalInstrumentBalanceAmount>0</ns3:TotalInstrumentBalanceAmount>
                <ns3:TransactionId>___pg_reference_number_1___</ns3:TransactionId>
                <ns3:TransactionTime>___timestamp___</ns3:TransactionTime>
                <ns3:UserId>___insurer_integration_location_code___</ns3:UserId>
                <ns3:WorkflowName></ns3:WorkflowName>
            </ns6:objUserDataPaymentTaging>
            <ns6:lstExistPayments/>
        </ns6:PaymentEntryCumPolicyGen>
    </soap:Body>
</soap:Envelope>